app/views/movies/_form.html.erb

    <th><%= form.label :Genre %></th>
    <td><%= form.collection_check_boxes :genre_ids, Genre.all, :id, :name do |b| %>
---
SELECT "genres".* FROM "genres" WHERE 1=0