app/views/movies/index.html.erb

SELECT AVG("scores"."score") FROM "scores" WHERE "scores"."movie_id" = $1  [["movie_id", 1]]
---
        <td class="center"><%= Time.at(movie.runtime).utc.strftime("%H:%M:%S")  %></td>
        <td class="center"><%= movie.scores.average(:score) %></td>