app/views/movies/show.html.erb

  <strong>Avg Score:</strong>
  <span id="avg_score"><%if (@movie.scores.average(:score)!= nil) %><%= @movie.scores.average(:score) %><% else %> No score yet <% end %>
---
SELECT AVG("scores"."score") FROM "scores" WHERE "scores"."movie_id" = $1  [["movie_id", 1]]

  <strong>Genres:</strong>
  <% @movie.genres.each do |g| %>
---
SELECT "genres".* FROM "genres" INNER JOIN "genres_movies" ON "genres"."id" = "genres_movies"."genre_id" WHERE "genres_movies"."movie_id" = $1  [["movie_id", 1]]