app/views/scores/create.js.erb

SELECT AVG("scores"."score") FROM "scores" WHERE "scores"."movie_id" = $1  [["movie_id", 1]]
---
console.log(<%= @score.score %>);
console.log(<%= @movie.scores.size %>);