app/views/scores/update.js.erb

console.log(<%= @score.score %>);
console.log(<%= @movie.scores.size %>);
---
SELECT AVG("scores"."score") FROM "scores" WHERE "scores"."movie_id" = $1  [["movie_id", 1]]