app/controllers/api/v1/movies_controller.rb

      def show
        # @movie = Moive.joins(:country).select('datacenters.*, countries.name as country').where('datacenters.id = ?', params[:id])
        # Movie.joins(:scores).group('scores.movie_id').select('movies.*, average(scores.score)').where('movies.id=?', 4)
        # Movie.select('movies.*, AVG(scores.score) AS average_score').group('scores.movie_id').joins(:scores)

        @movie = Movie.find_by_id(params[:id])
        if !@movie
          render json: { message: "Movie Record Not found"}, status: :not_found
        else
          # @genres = @movie.genres
          avg_score = @movie.scores.average(:score)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "movies".* FROM "movies" WHERE (3) LIMIT $1  [["LIMIT", 1]]
SELECT "scores".* FROM "scores" WHERE "scores"."movie_id" = $1  [["movie_id", 2]]
SELECT AVG("scores"."score") FROM "scores" WHERE "scores"."movie_id" = $1  [["movie_id", 2]]

      def create
        @movie = Movie.new(movie_params)
        @movie.user = @current_user
        @movie.save
        @genre_ids = params[:genre_ids]
        @genre_ids.each do |i|
          @movie.genres << Genre.find(i)
---
INSERT INTO "movies" ("name", "user_id", "preview_video_url", "runtime", "synopsis", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

      def update
        @movie = Movie.find_by_id(params[:movie][:id])
        if !@movie
        render json: { message: "Invalid Movie id"}, status: :not_found
        else
        if @movie.update(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "movies" SET "name" = $1, "preview_video_url" = $2, "runtime" = $3, "updated_at" = $4 WHERE "movies"."id" = $5  [["name", "Jumanji"], ["preview_video_url", "youtube.com\\jumanji"], ["runtime", 120], ["updated_at", "2020-03-08 23:10:20.935536"], ["id", 43]]

      def destroy
        @movie = Movie.find_by_id(params[:id])
        if !@movie
          render json: { message: "Invalid Movie id"}, status: :not_found
        else
          @movie.destroy
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
DELETE FROM "movies" WHERE "movies"."id" = $1  [["id", 8]]