app/controllers/api/v1/scores_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "scores".* FROM "scores" WHERE "scores"."movie_id" = $1 AND "scores"."user_id" = 1  [["movie_id", 4]]
SELECT COUNT(*) FROM "scores" WHERE "scores"."movie_id" = $1 AND "scores"."user_id" = 1  [["movie_id", 4]]
UPDATE "scores" SET "score" = $1, "updated_at" = $2 WHERE "scores"."id" = $3  [["score", 90], ["updated_at", "2020-03-08 00:48:24.323637"], ["id", 29]]
INSERT INTO "scores" ("user_id", "movie_id", "score", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["movie_id", 4], ["score", 80], ["created_at", "2020-03-08 00:26:57.046823"], ["updated_at", "2020-03-08 00:26:57.046823"]]
---
      def create
        @movie = Movie.find_by_id(params[:movie_id])
        if !@movie
          render json: { message: "Invalid Movie id"}, status: :not_found
        else
          @scores = @movie.scores.where(:user => current_user)
          if @scores.size == 1
          #  update score
            puts "update score"
            @scores[0].update_attributes(:score => params[:score])
            render json: { message: "Score updated"}, status: :ok
          else
            #create new score
            puts "create score"
            @score = @movie.scores.create(:score => params[:score], :user => current_user)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "scores".* FROM "scores" WHERE "scores"."movie_id" = $1 AND "scores"."user_id" = 1  [["movie_id", 4]]
SELECT COUNT(*) FROM "scores" WHERE "scores"."movie_id" = $1 AND "scores"."user_id" = 1  [["movie_id", 4]]
DELETE FROM "scores" WHERE "scores"."id" = $1  [["id", 29]]
---
      def destroy
        @movie = Movie.find_by_id(params[:movie_id])
        if !@movie
          render json: { message: "Invalid Movie id"}, status: :not_found
        else
          @scores = @movie.scores.where(:user => current_user)
          if @scores.size == 1
          #  delete the score
            @scores[0].destroy