app/controllers/movies_controller.rb

SELECT "scores".* FROM "scores" WHERE "scores"."movie_id" = $1 AND "scores"."user_id" = 1  [["movie_id", 1]]
---
  def show
   @score = @movie.scores.where(user_id: current_user)[0]

INSERT INTO "movies" ("name", "user_id", "preview_video_url", "synopsis", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", ""], ["user_id", 1], ["preview_video_url", ""], ["synopsis", ""], ["created_at", "2020-01-30 17:01:54.616888"], ["updated_at", "2020-01-30 17:01:54.616888"]]
---
  def create
    @movie = Movie.new(movie_params)
    @movie.user = current_user

    respond_to do |format|
      if @movie.save