app/controllers/scores_controller.rb

	 def create
     @score = @movie.scores.create(:score => params[:score][:score], :user => current_user)
---
INSERT INTO "scores" ("user_id", "movie_id", "score", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["movie_id", 6], ["score", 90], ["created_at", "2020-02-01 23:53:47.681637"], ["updated_at", "2020-02-01 23:53:47.681637"]]

    def update
      @score = Score.find(params[:id])
      @score.update_attributes(:score => params[:score][:score])
---
SELECT  "scores".* FROM "scores" WHERE "scores"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "scores" SET "score" = $1, "updated_at" = $2 WHERE "scores"."id" = $3  [["score", nil], ["updated_at", "2020-02-01 23:41:16.269742"], ["id", 1]]

    def delete
        @score = Score.find(params[:id])
        @score.destroy
---
SELECT  "scores".* FROM "scores" WHERE "scores"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "scores" WHERE "scores"."id" = $1  [["id", 8]]